Revit 2027 API
VertexIndexPairArray.Item Property
Gets or sets a VertexIndex pair at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual VertexIndexPair this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As VertexIndexPair
	Get
	Set
public:
virtual property VertexIndexPair^ Item[int index] {
	VertexIndexPair^ get (int index);
	void set (int index, VertexIndexPair^ value);
}
abstract Item : VertexIndexPair with get, set
override Item : VertexIndexPair with get, set
Parameters
index Int32
The index of the VertexIndex pair to be set or retrieved.
Return Value
VertexIndexPair
Returns the VertexIndex pair at the specified index.
See Also
Reference
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace